In [1]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [63]:
import warnings
warnings.simplefilter('ignore')

# para pintar
import pylab as plt
import seaborn as sns
import numpy as np

# para que salga el grafico
%matplotlib inline


## Carga de los datos

In [5]:
actor_csv=pd.read_csv("../data/actor.csv")
category_csv=pd.read_csv("../data/category.csv")
film_csv=pd.read_csv("../data/film.csv")
inventory_csv=pd.read_csv("../data/inventory.csv")
language_csv=pd.read_csv("../data/language.csv")
rental_csv=pd.read_csv("../data/rental.csv")

## Exploraci√≥n de los datos

Exploramos actor_csv

In [80]:
actor_csv.head(2)

   actor_id first_name last_name
0         1   PENELOPE   GUINESS
1         2       NICK  WAHLBERG

In [8]:
actor_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

Exploramos category_csv:

In [36]:
category_csv.head(1)

   category_id    name          last_update
0            1  Action  2006-02-15 04:46:27

In [10]:
category_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

Exploramos film_csv:

In [82]:
film_csv.head(2)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",4
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",14

In [13]:
film_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

Exploramos inventory_csv:

In [40]:
inventory_csv.head(2)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17

In [20]:
inventory_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

Exploramos language_csv:

In [42]:
language_csv.head(2)

   language_id     name          last_update
0            1  English  2006-02-15 05:02:19
1            2  Italian  2006-02-15 05:02:19

In [22]:
language_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

Exploramos rental_csv:

In [44]:
rental_csv.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [24]:
rental_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

Despu√©s de explorar las tablas vemos que es un negocio de alquiler de pel√≠culas. 

Por un lado tenemos la tabla rental_csv que es como si fueran los invoices, es decir para cada pel√≠cula que se alquila tenemos la informaci√≥n sobre esa operaci√≥n. Esta tabla se relaciona por un lado a inventory_csv por el inventory_id ya que tenemos que saber que cinta particular de nuestro stock se ha alquilado. De la misma manera, el inventory_csv esta unido a film_csv por el film_id ya que tenemos que saber a que t√≠tulo de pel√≠cula corresponde la cinta que estamos alquilando. 


Tambi√©n tenemos relaci√≥n entrar film_csv y language_csv >> est√°n relacionadas por el language_id ya que tenemos que saber en que lenguaje est√° la pel√≠cula.

Finalmente tenemos dos otras tablas (actor_csv y category_csv) que de primeras no parecen tener relaci√≥n. Sin embargo tendremos que a√±adirla m√°s adelante.

#### Entre film_csv y actor_csv habr√° una relaci√≥n many to many y entre category_id y film_id habr√° una relaci√≥n one to one

# Limpieza de Datos

Hemos visto que solo hay nulos en el film_csv en la columna original_language_id que es toda nula, por lo que vamos a eliminar la columna directamente

In [25]:
film_csv.drop('original_language_id', axis=1, inplace=True)

In [27]:
film_csv.head(1)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42

Vamos a eliminar los duplicados

In [28]:
actor_csv.duplicated().any()

False

In [29]:
category_csv.duplicated().any()

False

In [30]:
film_csv.duplicated().any()

False

In [32]:
inventory_csv.duplicated().any()

False

In [33]:
language_csv.duplicated().any()

False

In [34]:
rental_csv.duplicated().any()

False

No hay duplicados en ning√∫n csv por lo que ya est√°n limpios los datos

Las columnas last_update entiendo que hacen referencia a la √∫ltima vez que se actualiz√≥ la base de datos por lo que no me van a ofrecer informaci√≥n relevante, as√≠ que las elimino.

In [45]:
actor_csv.drop('last_update', axis=1, inplace=True)
category_csv.drop('last_update', axis=1, inplace=True)
film_csv.drop('last_update', axis=1, inplace=True)
inventory_csv.drop('last_update', axis=1, inplace=True)
language_csv.drop('last_update', axis=1, inplace=True)
rental_csv.drop('last_update', axis=1, inplace=True)

In [56]:
category_csv.to_csv("../data/clean_csv/category_new.csv",index=False)

In [58]:
inventory_csv.to_csv("../data/clean_csv/inventory_new.csv",index=False)

In [59]:
language_csv.to_csv("../data/clean_csv/language_new.csv",index=False)

In [60]:
rental_csv.to_csv("../data/clean_csv/rental_new.csv",index=False)

In [61]:
actor_csv.to_csv("../data/clean_csv/actor.csv",index=False)

# Relacionamos "category_csv"

El category_id va del 1-16 por lo que vamos a a√±adir una columna random a la tabla film_csv con n√∫meros del 1-16 para que tenga relaci√≥n con category_csv porque es one to many, es decir una category puede estar en muchas pelis pero una peli solo puede tener una category

In [64]:
film_csv['category_id'] = np.random.randint(1, 16, size=len(film_csv))

In [66]:
film_csv.to_csv("../data/clean_csv/film_new.csv",index=False)

# Relacionamos "actor_csv"

Vamos a crear una nueva dataframe con las columnas actor_csv y category_csv de manera que implementemos la relaci√≥n many to many de ambas.

Vamos a crear una lista de 2000 filas que tenga una columna de film_id con film_ids random cogidos de film_csv y que tenga una columna de actor_id con actor_ids random cogidos de actor_csv

In [75]:
actor_film=pd.DataFrame()

In [83]:
index_n=np.random.randint(1, 1000, size=2*len(film_csv))

In [84]:
for i in range(1,2000):
    
    actor_film["film_id"]=index_n

In [86]:
index_n=np.random.randint(1, 200, size=2*len(film_csv))

In [87]:
for i in range(1,2000):
    
    actor_film["actor_id"]=index_n

In [89]:
actor_film.head(3)

   film_id  actor_id
0      867       182
1      355       131
2       41        76

Exportamos la nueva tabla a csv

In [90]:
actor_film.to_csv("../data/clean_csv/actor_film.csv",index=False)